src/Documents/Пост/Пост.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Пост</name>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>CatalogRef.Картины</types>
      <types>CatalogRef.События</types>
      <types>CatalogRef.Цитаты</types>
      <types>CatalogRef.Термины</types>
      <types>CatalogRef.Произведения</types>
      <types>CatalogRef.Колонки</types>
      <types>CatalogRef.Сообщества</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаДвоичные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Сообщество</name>
    <type>
      <types>CatalogRef.Сообщества</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКартинки</name>
    <type>
      <types>EnumRef.ВидыКартинок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВК_НомерПоста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТГ_НомерПоста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Уровень</name>
    <type>
      <types>EnumRef.УровниПостов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Тэги</name>
    <attributes>
      <name>Тэг</name>
      <type>
        <types>CatalogRef.Тэги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Произведения/Произведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Произведения</name>
  <predefined>
    <items>
      <name>Оповещение</name>
      <description>Оповещение</description>
    </items>
  </predefined>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Люди</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаСайте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаДвоичные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Слов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьВПодборках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/Пост/ObjectModule.bsl
#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Процедура ОбработкаПроведения(Отказ, Режим)
		
		Если Режим = РежимПроведенияДокумента.Оперативный Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДокументПост.Ссылка КАК Ссылка,
			|	ДокументПост.ПометкаУдаления КАК ПометкаУдаления,
			|	ДокументПост.Номер КАК Номер,
			|	ДокументПост.Дата КАК Дата,
			|	ДокументПост.Проведен КАК Проведен,
			|	ДокументПост.Содержание КАК Содержание,
			|	ДокументПост.Картинка КАК Картинка,
			|	ДокументПост.МоментВремени КАК МоментВремени,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ДокументПост.Содержание.Автор, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
			|			ТОГДА ВЫБОР
			|					КОГДА ДокументПост.Содержание.ПроизведениеАвтор ССЫЛКА Справочник.Произведения
			|						ТОГДА ДокументПост.Содержание.ПроизведениеАвтор.Автор
			|					ИНАЧЕ ВЫБОР
			|							КОГДА ДокументПост.Содержание ССЫЛКА Справочник.Колонки
			|								ТОГДА ДокументПост.Содержание
			|							ИНАЧЕ ДокументПост.Содержание.ПроизведениеАвтор
			|						КОНЕЦ
			|				КОНЕЦ
			|		ИНАЧЕ ДокументПост.Содержание.Автор
			|	КОНЕЦ КАК Автор,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ДокументПост.Содержание.Автор, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
			|			ТОГДА ВЫБОР
			|					КОГДА ДокументПост.Содержание.ПроизведениеАвтор ССЫЛКА Справочник.Произведения
			|						ТОГДА ""Отрывок""
			|					ИНАЧЕ ВЫБОР
			|							КОГДА ДокументПост.Содержание ССЫЛКА Справочник.Колонки
			|								ТОГДА ""Колонка""
			|							ИНАЧЕ ""Цитата""
			|						КОНЕЦ
			|				КОНЕЦ
			|		ИНАЧЕ ""Произведение""
			|	КОНЕЦ КАК Вид
			|ИЗ
			|	Документ.Пост КАК ДокументПост
			|ГДЕ
			|	ДокументПост.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				
				Движение 				= РегистрыСведений.ПорядокПостов.СоздатьМенеджерЗаписи();
				Движение.Пост 			= ВыборкаДетальныеЗаписи.Ссылка;
				Движение.Опубликован 	= ЛОЖЬ;
				Движение.Дата 			= ВыборкаДетальныеЗаписи.Дата;
				Движение.Автор 			= ВыборкаДетальныеЗаписи.Автор;
				Движение.Вид			= ВыборкаДетальныеЗаписи.Вид;
				Движение.ДатаПубликации = Дата(1,1,1);
				Движение.Записать(Истина);
				
			КонецЕсли;
		КонецЕсли;
	КонецПроцедуры
	
	
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
#КонецОбласти
